# InfillNoSlopeGlazing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..InfillFailures..::..InfillNoSlopeGlazing Property
BuiltInFailures..::..InfillFailures Class See Also
---
Could not change type due to highlighted infilling element. 'Sloped glazing' infills are not allowed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InfillNoSlopeGlazing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InfillNoSlopeGlazing As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InfillNoSlopeGlazing {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..InfillFailures Class
Autodesk.Revit.DB Namespace